In [1]:
import pandas as pd

In [2]:
data = {
    'date': ['2021-12-01', '01-12-2022', '2022/12/01', '12-01-2021'],
    'country': ['USA', 'U.S.A.', 'America', 'United States'],
    'name': ['Saiful', 'Saif', 'Nabil', 'Nafis'],
    'sales_2020': [100, 200, None, 200],
    'sales_2021': [None, 150, 300, 150]
}
# make pandas dataframe
df = pd.DataFrame(data)

In [3]:
df.head()

         date        country    name  sales_2020  sales_2021
0  2021-12-01            USA  Saiful       100.0         NaN
1  01-12-2022         U.S.A.    Saif       200.0       150.0
2  2022/12/01        America   Nabil         NaN       300.0
3  12-01-2021  United States   Nafis       200.0       150.0

In [4]:
df['date']=pd.to_datetime(df['date'],errors='coerce')
df['date']=df['date'].dt.strftime('%Y-%m-%d')

In [5]:
df.head()

         date        country    name  sales_2020  sales_2021
0  2021-12-01            USA  Saiful       100.0         NaN
1         NaN         U.S.A.    Saif       200.0       150.0
2         NaN        America   Nabil         NaN       300.0
3         NaN  United States   Nafis       200.0       150.0

In [6]:
Country={'USA':'United States','U.S.A.':'United States','America':'United States',}
df['country']=df['country'].replace(Country)

In [7]:
df.head()

         date        country    name  sales_2020  sales_2021
0  2021-12-01  United States  Saiful       100.0         NaN
1         NaN  United States    Saif       200.0       150.0
2         NaN  United States   Nabil         NaN       300.0
3         NaN  United States   Nafis       200.0       150.0

In [8]:
Name={'Saiful':'Saif','Nafis':'Nabil'}

In [9]:
df['name']=df['name'].replace(Name)

In [10]:
df.head()

         date        country   name  sales_2020  sales_2021
0  2021-12-01  United States   Saif       100.0         NaN
1         NaN  United States   Saif       200.0       150.0
2         NaN  United States  Nabil         NaN       300.0
3         NaN  United States  Nabil       200.0       150.0

In [13]:
df=df.drop_duplicates(subset="name")
df.head()

         date        country   name  sales_2020  sales_2021
0  2021-12-01  United States   Saif       100.0         NaN
2         NaN  United States  Nabil         NaN       300.0

In [18]:
df = df.drop(df[df['sales_2020'] <= df['sales_2021']].index)
df.head()

         date        country   name  sales_2020  sales_2021
0  2021-12-01  United States   Saif       100.0         NaN
2         NaN  United States  Nabil         NaN       300.0